       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT OPTIONAL EMPLEADOS-ARCHIVOS
       ASSIGN TO "empleados.dat"
       ORGANIZATION IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD EMPLEADOS-ARCHIVOS.
           01 EMPLEADOS-REGISTROS.
               02 EMPLEADOS-ID PIC X(6).
               02 EMPLEADOS-NOMBRE PIC X(25).
               02 EMPLEADOS-APELLIDOS PIC X(35).
               02 EMPLEADOS-EDAD PIC XX.
       WORKING-STORAGE SECTION.
       01 PRESENTACION.
           02 TEXTO-ID PIC XXX VALUE "ID:".
           02 MUESTRA-ID PIC X(6).
           02 TEXTO-NOMBRE PIC X(7) VALUE "NOMBRE:".
           02 MUESTRA-NOMBRE PIC X(15).
           02 TEXTO-APELLIDOS PIC X(10) VALUE "APELLIDOS:".
           02 MUESTRA-APELLIDOS PIC X(20).
           02 TEXTO-EDAD PIC X(5) VALUE "EDAD:".
           02 MUESTRA-EDAD PIC XX.
       01 FIN-DEL-ARCHIVO PIC X.
       01 MAXIMO-REGISTROS PIC 9.
       01 GUARDA-ENTER PIC X.
       PROCEDURE DIVISION.
       EMPIEZA-PROGRAMA.
           PERFORM APERTURA-ARCHIVO.
           MOVE ZEROES TO MAXIMO-REGISTROS.
           MOVE "1" TO FIN-DEL-ARCHIVO.
           PERFORM LEE-SIGUIENTE-REGISTRO.
           PERFORM MUESTRA-REGISTROS UNTIL FIN-DEL-ARCHIVO EQUAL "0".
           PERFORM CIERRE-ARCHIVO.
       PROGRAM-DONE.
           STOP RUN.
       APERTURA-ARCHIVO.
           OPEN INPUT EMPLEADOS-ARCHIVOS.
       CIERRE-ARCHIVO.
           CLOSE EMPLEADOS-ARCHIVOS.
       MUESTRA-REGISTROS.
           PERFORM MUESTRA-CAMPOS.
           PERFORM LEE-SIGUIENTE-REGISTRO.
       MUESTRA-CAMPOS.
           IF MAXIMO-REGISTROS EQUAL 5 THEN PERFORM PULSAR-ENTER END-IF.
           MOVE EMPLEADOS-ID TO MUESTRA-ID.
           MOVE EMPLEADOS-NOMBRE TO MUESTRA-NOMBRE.
           MOVE EMPLEADOS-APELLIDOS TO MUESTRA-APELLIDOS.
           MOVE EMPLEADOS-EDAD TO MUESTRA-EDAD.
           DISPLAY PRESENTACION.
           ADD 1 TO MAXIMO-REGISTROS.
       LEE-SIGUIENTE-REGISTRO.
           READ EMPLEADOS-ARCHIVOS NEXT RECORD AT END
           MOVE "0" TO FIN-DEL-ARCHIVO.
       PULSAR-ENTER.
           DISPLAY
           "PRESIONE LA TECLA ENTER PARA VER LA SIGUIENTE PAGINA...".
           ACCEPT GUARDA-ENTER.
           MOVE ZEROES TO MAXIMO-REGISTROS.
       END PROGRAM DB.
