       01 IDENTIFICADOR PIC X(36) VALUE "INTRODUCE EL ID DEL EMPLEADO".
       01 NOMBRE PIC X(33) VALUE "INTRODUCE EL NOMBRE DEL EMPLEADO".
       01 APELLIDO PIC X(34) VALUE "INTRODUCE EL APELLIDO DEL EMPLEADO".
       01 EDAD PIC X(30) VALUE "INTRODUCE LA EDAD DEL EMPLEADO".
       01 SI-NO PIC X.
       01 ENTRY-OK PIC X.
