      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       01 IDENTIFICADOR PIC X(36) VALUE "INTRODUCE EL ID DE LA CANCION".
       01 NOMBRE PIC X(33) VALUE "INTRODUCE EL NOMBRE DE LA CANCION.".
       01 APELLIDO PIC X(34) VALUE "INTRODUCE EL CANTANTE.".
       01 SI-NO PIC X.
       01 ENTRY-OK PIC X.
