      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       FD EMPLEADOS-ARCHIVOS.
           01 EMPLEADOS-REGISTROS.
               02 EMPLEADOS-ID PIC X(6).
               02 EMPLEADOS-NOMBRE PIC X(25).
               02 EMPLEADOS-APELLIDOS PIC X(35).
               02 EMPLEADOS-EDAD PIC 99.
