000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. NODELIB.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 OPC       PIC X.
000700 01 INTERES   PIC 99V99.
000800 01 DECIMA    PIC V999.
000900 01 PRINCIPAL PIC 9(9)V99.
001000 01 VALOR     PIC 9(9)V99.
001100 01 GENERA    PIC 9(9)V99.
001200 01 PERIODO   PIC 9999.
001300 01 NPERIODOS PIC 999.
001400 01 ENTRADA   PIC Z(9),ZZ.
001500 01 MOSTRAR   PIC ZZZ,ZZZ,ZZ9.99.
001600 PROCEDURE DIVISION.
001700 MAIN-PROCEDURE.
001800     MOVE "S" TO OPC.
001900     PERFORM MOSTRAR-RESULTADO
002000     UNTIL OPC = "N".
002100 TERMINA-PROGRAMA.
002200     STOP RUN.
002300 MOSTRAR-RESULTADO.
002400     PERFORM VALOR-PRINCIPAL.
002500     PERFORM OBTENER-INTERES.
002600     PERFORM OBTENER-PERIODOS.
002700     PERFORM CALCULAR-RESULTADO.
002800     PERFORM NUEVO.
002900     PERFORM SHOW.
003000 VALOR-PRINCIPAL.
003100     DISPLAY "EL VALOR PRINCIPAL ES (.01 A 999999999.99)".
003200     ACCEPT ENTRADA.
003300     MOVE ENTRADA TO PRINCIPAL.
003400     IF PRINCIPAL < .01 OR PRINCIPAL > 999999999.9 THEN
003500        DISPLAY "ENTRADA INVALIDA."
003600        GO TO VALOR-PRINCIPAL.
003700 OBTENER-INTERES.
003800     DISPLAY "INTERES DESDE .1% HASTA 99.9%".
003900     ACCEPT ENTRADA.
004000     MOVE ENTRADA TO INTERES.
004100     IF INTERES < .1 OR INTERES > 99.9 THEN
004200         DISPLAY "ENTRADA INVALIDA."
004300         GO TO OBTENER-INTERES
004400         ELSE
004500             COMPUTE DECIMA = INTERES / 100
004600             DISPLAY DECIMA.
004700 OBTENER-PERIODOS.
004800     DISPLAY "NUMEROS DE PERIODOS (1 HASTA 999)".
004900     ACCEPT ENTRADA.
005000     MOVE ENTRADA TO NPERIODOS.
005100     IF NPERIODOS < 1 OR NPERIODOS > 999 THEN
005200         DISPLAY "ENTRADA INVALIDA."
005300         GO OBTENER-PERIODOS.
005400 CALCULAR-RESULTADO.
005500     PERFORM CALCULAR-PERIODO
005600         VARYING PERIODO FROM 1 BY 1
005700             UNTIL PERIODO > NPERIODOS.
005800 CALCULAR-PERIODO.
005900     COMPUTE GENERA ROUNDED = PRINCIPAL * DECIMA.
006000     COMPUTE VALOR = PRINCIPAL + GENERA.
006100     MOVE VALOR TO PRINCIPAL.
006200 SHOW.
006300     MOVE VALOR TO MOSTRAR.
006400     DISPLAY "EL RESULTADO DEL VALOR ES: " MOSTRAR.
006500 NUEVO.
006600     DISPLAY "VA DE NUEVO."
006700     ACCEPT OPC.
006800     IF OPC EQUAL "S" THEN MOVE "S" TO OPC END-IF.
006900     IF OPC EQUAL "N" THEN MOVE "N" TO OPC END-IF.
007000 END PROGRAM NODELIB.
